## Pandas exercise

In [8]:
# import necessary libraries
import numpy as np
import pandas as pd

Create and display a DataFrame from a specified dictionary data and index labels.

In [9]:
exam_data = {'name': ['Anne', 'David', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'John'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [12]:
df_exam = pd.DataFrame(exam_data)
df_label = pd.DataFrame(labels)

Display the first 3 rows of the data frame.

In [18]:
display(df_exam[0:3])

        name  score  attempts qualify
0       Anne   12.5         1     yes
1      David    9.0         3      no
2  Katherine   16.5         2     yes

Display the name and score columns of the data frame.

In [22]:
display(df_exam[["name" ,"score"]])

        name  score
0       Anne   12.5
1      David    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9       John   19.0

Display the name and score columns and rows 1, 3, 4 and 8.

In [27]:
display(df_exam.loc [[1, 3, 4, 8], ["name" ,"score",]])

    name  score
1  David    9.0
3  James    NaN
4  Emily    9.0
8  Kevin    8.0

Display the rows where the number of attempts is greater than 2.

In [35]:
display(df_exam[df_exam['attempts'] > 2])

      name  score  attempts qualify
1    David    9.0         3      no
3    James    NaN         3      no
5  Michael   20.0         3     yes

Display the rows where score is greater or equal than a pass rate of 10.

In [36]:
display(df_exam[df_exam['score'] >= 10])

        name  score  attempts qualify
0       Anne   12.5         1     yes
2  Katherine   16.5         2     yes
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
9       John   19.0         1     yes

Display the rows where the score is missing.

In [41]:
display(df_exam[df_exam['score'].isna()])

    name  score  attempts qualify
3  James    NaN         3      no
7  Laura    NaN         1      no